expanse/expanse_sim_lognormal/0.orig/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

"procBoundary.*"
{
    type            processor;
    value           uniform (0 0 0);
}

    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 1e-07;
        extrapolateProfile yes;
        value           uniform (0 0 0);
    }

    outlet
    {
		type            zeroGradient;

    }

    top
    {
        // type            noSlip;
        // type            symmetryPlane;
        type            cyclic;
    }

    bottom
    {
        // type            noSlip;
        // type            symmetryPlane;
        type            cyclic;
    }

    front
    {
         // type            noSlip;
        // type            symmetryPlane;
        type            cyclic;
    }

    back
    {
        // type            noSlip;
        // type            symmetryPlane;
        type            cyclic;
    }

    media
    {
        type            noSlip;
    }

}


// ************************************************************************* //
